app/views/profiles/list.html.erb

SELECT COUNT(*) FROM `gums` INNER JOIN `gum_rating_relationships` ON `gums`.`id` = `gum_rating_relationships`.`gum_id` WHERE `gum_rating_relationships`.`profile_id` = 4 AND `gums`.`active` = 1
---
				<li class = "score"><div class = "header">Votes Bubble</div><%= p.user.vote_count(:up) %></li>
				<li class = "score"><div class = "header">Gums Rated</div><%= p.gums.active.count %></li>