app/controllers/billings_controller.rb

SELECT `billings`.* FROM `billings` WHERE `billings`.`user_id` = 6 AND `billings`.`subscription_number` = 1 LIMIT 1
---
  def edit
    @billing = Billing.find_by_user_id_and_subscription_number(current_user.id, params[:id])

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 6 LIMIT 1
---
  def create
    @billing = Billing.new
    @billing.user_id = current_user.id
    set_values(params[:billing])
    # payment info not set in "set_values" because only used for new subscriptions
    @payment_info = {:number => @billing.pan, :verification_value => @billing.cvc, :month => @billing.expiry_month.slice(0..1).to_i,
        :year => @billing.expiry_year, :first_name => @billing.bill_first_name, :last_name => @billing.bill_last_name}#,:brand => 'visa'} #BRAND IS STILL STATIC...
    profile = Profile.find_by_user_id(current_user.id)

INSERT INTO `billings` (`bill_city`, `bill_company`, `bill_country`, `bill_first_name`, `bill_last_name`, `bill_postal_code`, `bill_state_province`, `bill_street`, `created_at`, `expiry_month`, `expiry_year`, `gateway_subscriber_id`, `last_four`, `ship_city`, `ship_company`, `ship_country`, `ship_first_name`, `ship_last_name`, `ship_postal_code`, `ship_state_province`, `ship_street`, `subscription_name`, `subscription_number`, `updated_at`, `user_id`) VALUES ('San Diego', '', 'United States', 'Kevin', 'Hoiland', '92109', 'CA', '4262 Kendall St', '2013-05-09 03:49:18', '02 - February', '2015', '16768166', '7133', 'San Diego', '', 'United States', 'Kevin', 'Hoiland', '92109', 'CA', '4262 Kendall St', 'testing', 1, '2013-05-09 03:49:18', 6)
UPDATE `profiles` SET `subscriptions_created` = 1, `updated_at` = '2013-05-09 03:49:18' WHERE `profiles`.`id` = 5
---

          #@billing.cvc = 123 # hack to save billing
          #IF BILLING SAVE....    ############################### (add code here)
          @billing.save
          profile.subscriptions_created += 1
          profile.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
  def set_values (billing_info)
    @billing.subscription_name = billing_info[:subscription_name]
    @billing.ship_first_name = billing_info[:ship_first_name]
    @billing.ship_last_name = billing_info[:ship_last_name]
    @billing.ship_company = billing_info[:ship_company]
    @billing.ship_street = billing_info[:ship_street]
    @billing.ship_city = billing_info[:ship_city]
    @billing.ship_state_province = billing_info[:ship_state_province]
    @billing.ship_postal_code = billing_info[:ship_postal_code]
    @billing.ship_country = billing_info[:ship_country]
    @billing.bill_street = billing_info[:bill_street]
    @billing.bill_city = billing_info[:bill_city]
    @billing.bill_state_province = billing_info[:bill_state_province]
    @billing.bill_postal_code = billing_info[:bill_postal_code]
    @billing.bill_country = billing_info[:bill_country]
    @billing.bill_first_name = billing_info[:bill_first_name]
    @billing.bill_last_name = billing_info[:bill_last_name]
    @billing.bill_company = billing_info[:bill_company]
    @billing.expiry_month = billing_info[:expiry_month]
    @billing.expiry_year = billing_info[:expiry_year]
    @billing.cvc = billing_info[:cvc]
    @billing.pan = billing_info[:pan].gsub(/[^0-9]/, "")
    @billing.terms = billing_info[:terms]
    if @billing.pan > ""  # Only update the last_four DB value from pan attribute accessor if something exists for pan
      @billing.last_four = @billing.pan.to_s.slice(-4..-1)
    end
    @ip = User.find(@billing.user_id).current_sign_in_ip

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 6 LIMIT 1
---
    #@customer = @billing.user_id.to_s+":"+(Profile.find_by_user_id(@billing.user_id).subscriptions_created-Profile.find_by_user_id(@billing.user_id).subscriptions_deleted+1).to_s

    #@customer = @billing.user_id.to_s+":"+(Profile.find_by_user_id(@billing.user_id).subscriptions_created+1).to_s
    @customer = {:id => @billing.user_id.to_s+":"+(Profile.find_by_user_id(@billing.user_id).subscriptions_created+1).to_s, :email => User.find(@billing.user_id).email}