app/controllers/gums_controller.rb

  def show
    @content_legal = DynamicText.content("gum_specific").order("sequence ASC")
    @gum = Gum.active.find_by_permalink(params[:id]) || not_found
    @votes_up_total = @gum.votes_for
    @votes_down_total = @gum.votes_against
    @rating_averages = @gum.get_rating_averages
    @rating_count = GumRatingRelationship.where(:gum_id => @gum.id).count
---
SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%gum_specific%' AND visible = '1') ORDER BY sequence ASC
SELECT `gums`.* FROM `gums` WHERE `gums`.`active` = 1 AND `gums`.`permalink` = 'up2u_superfruit_smasher_tropical_mixer' LIMIT 1
SELECT COUNT(*) FROM `gum_rating_relationships` WHERE `gum_rating_relationships`.`gum_id` = 174

  def vote_up
    gum = Gum.active.find_by_permalink(params[:permalink]) || not_found
---
SELECT `gums`.* FROM `gums` WHERE `gums`.`active` = 1 AND `gums`.`permalink` = 'up2u_superfruit_smasher_tropical_mixer' LIMIT 1

  def vote_down
    gum = Gum.active.find_by_permalink(params[:permalink]) || not_found
---
SELECT `gums`.* FROM `gums` WHERE `gums`.`active` = 1 AND `gums`.`permalink` = 'up2u_superfruit_smasher_tropical_mixer' LIMIT 1