app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 3 LIMIT 1
---
  def show
    @profile = Profile.find(params[:id])

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 3 LIMIT 1
---
  def edit
    @self_profile = Profile.find_by_user_id(current_user.id)

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 6 LIMIT 1
UPDATE `profiles` SET `name` = 'adfasdfasdfas', `location` = '', `age` = '', `sex` = '', `story` = '', `updated_at` = '2013-05-09 04:19:54' WHERE `profiles`.`id` = 6
---
  def update
    @self_profile = Profile.find_by_user_id(current_user.id)
    if @self_profile.update_attributes(params[:profile])