app/controllers/ratings_controller.rb

SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%gum_specific%' AND visible = '1') ORDER BY sequence ASC
SELECT `gums`.* FROM `gums` WHERE `gums`.`id` = 90 LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
  def show
    @content_legal = DynamicText.content("gum_specific").order("sequence ASC")
    @rating = GumRatingRelationship.with_active_gum.find(params[:id])
    @profile = Profile.find(@rating.profile_id)

SELECT `gums`.* FROM `gums` WHERE `gums`.`active` = 1 AND `gums`.`permalink` = 'adams_chiclets_peppermint' LIMIT 1
SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%gum_specific%' AND visible = '1') ORDER BY sequence ASC
---
  def per_gum
    #@gum = Gum.find(params[:gum_id])
    @gum = Gum.active.find_by_permalink(params[:gum_permalink]) || not_found
    @content_legal = DynamicText.content("gum_specific").order("sequence ASC")

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 3 LIMIT 1
SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%gum_general%' AND visible = '1') ORDER BY sequence ASC
---
  def per_member
    @profile = Profile.find(params[:id])
    @content_legal = DynamicText.content("gum_general").order("sequence ASC")

SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%gum_specific%' AND visible = '1') ORDER BY sequence ASC
SELECT `gums`.* FROM `gums` WHERE `gums`.`active` = 1 AND `gums`.`id` = 174 LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 3 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def edit
    @content_legal = DynamicText.content("gum_specific").order("sequence ASC")
    @changed_rating = GumRatingRelationship.with_active_gum.find(params[:id])
    @gum = Gum.active.find(@changed_rating.gum_id) || not_found

    # trying to fix feb 22nd 2013
    # unless current_user.id == @changed_rating.profile_id  ########################### THIS IS NOT GUARENTEED, WTF, SHOULD BE USER_ID EVERYWHERE...
    unless User.find(current_user.id).profile.id == @changed_rating.profile_id

SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%gum_specific%' AND visible = '1') ORDER BY sequence ASC
SELECT `gums`.* FROM `gums` WHERE `gums`.`active` = 1 AND `gums`.`permalink` = 'up2u_superfruit_smasher_tropical_mixer' LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT 1 AS one FROM `gum_rating_relationships` WHERE `gum_rating_relationships`.`profile_id` = 1 AND `gum_rating_relationships`.`gum_id` = 174 LIMIT 1
SELECT `gum_rating_relationships`.* FROM `gum_rating_relationships` WHERE `gum_rating_relationships`.`profile_id` = 3 AND `gum_rating_relationships`.`gum_id` = 174 LIMIT 1
SELECT `gum_rating_relationships`.* FROM `gum_rating_relationships` WHERE `gum_rating_relationships`.`id` = 15 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def new
    @content_legal = DynamicText.content("gum_specific").order("sequence ASC")
    #@gum = Gum.find(params[:gum_id])
    @gum = Gum.active.find_by_permalink(params[:gum_permalink]) || not_found
    @profile = Profile.find_by_user_id(current_user.id)
#    @help = GumRatingRelationship.already_rated(@profile.id, @gum.id).exists? ### probably don't need this long term, maybe was just for debuggin?
    if GumRatingRelationship.already_rated(@profile.id, @gum.id).exists?
      @rated = GumRatingRelationship.find(GumRatingRelationship.already_rated(@profile.id, @gum.id).first)

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 3 LIMIT 1
SELECT `gums`.* FROM `gums` WHERE `gums`.`permalink` = 'adams_chiclets_peppermint' LIMIT 1
INSERT INTO `gum_rating_relationships` (`average`, `comment`, `created_at`, `gum_id`, `profile_id`, `rank_1`, `rank_2`, `rank_3`, `rank_4`, `rank_5`, `total`, `updated_at`) VALUES (0.0, 'asfasfdasdfd', '2013-05-08 05:00:23', 86, 3, NULL, NULL, NULL, NULL, NULL, 0, '2013-05-08 05:00:23')
SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%gum_specific%' AND visible = '1') ORDER BY sequence ASC
SELECT `gums`.* FROM `gums` WHERE `gums`.`active` = 1 AND `gums`.`permalink` = 'adams_chiclets_peppermint' LIMIT 1
---
  def create
    @new_rating = GumRatingRelationship.new
    #@new_rating.profile_id = Profile.find_by_user_id(current_user.id)

    #trying to fix this (feb 22nd 2013)
    #@new_rating.profile_id = current_user.id   #### THIS IS WHY IT IS FUCKED UP, SAVING CURRENT_USER.ID AS PROFILE.ID, NOT ALWAYS THE SAME THING...
    @new_rating.profile_id = Profile.find_by_user_id(current_user.id).id

    #@new_rating.gum_id = params[:gum_id]
    @new_rating.gum_id = get_gum_id(params[:gum_permalink])
    @new_rating.rank_1 = params[:gum_rating_relationship][:rank_1]
    @new_rating.rank_2 = params[:gum_rating_relationship][:rank_2]
    @new_rating.rank_3 = params[:gum_rating_relationship][:rank_3]
    @new_rating.rank_4 = params[:gum_rating_relationship][:rank_4]
    @new_rating.rank_5 = params[:gum_rating_relationship][:rank_5]
    @new_rating.comment = params[:gum_rating_relationship][:comment]
    values = [@new_rating.rank_1.to_i,@new_rating.rank_2.to_i,@new_rating.rank_3.to_i,@new_rating.rank_4.to_i,@new_rating.rank_5.to_i]
    @new_rating.total = values.sum
    @new_rating.average = @new_rating.total / values.size.to_f.round(2)
    if @new_rating.save
      flash[:notice] = "New Rating created"
      #redirect_to(gum_url(@new_rating.gum_id))
      redirect_to(gum_url(get_permalink(@new_rating.gum_id)))
    else
      flash[:alert] = "New Rating Save failed :("
      @content_legal = DynamicText.content("gum_specific").order("sequence ASC")
      @gum = Gum.active.find_by_permalink(params[:gum_permalink]) || not_found

SELECT `gum_rating_relationships`.* FROM `gum_rating_relationships` WHERE `gum_rating_relationships`.`id` = 17 LIMIT 1
SELECT `gums`.* FROM `gums` WHERE `gums`.`id` = 86 LIMIT 1
UPDATE `gum_rating_relationships` SET `rank_1` = NULL, `rank_2` = NULL, `rank_3` = NULL, `rank_4` = NULL, `rank_5` = NULL, `comment` = 'adfasdfa', `total` = 0, `average` = 0.0, `updated_at` = '2013-05-09 03:30:25' WHERE `gum_rating_relationships`.`id` = 21
---
  def update
    @changed_rating = GumRatingRelationship.find(params[:id])
#    @changed_rating.user_id = current_user.id
#    @changed_rating.gum_id = params[:gum_id]
    @changed_rating.rank_1 = params[:gum_rating_relationship][:rank_1]
    @changed_rating.rank_2 = params[:gum_rating_relationship][:rank_2]
    @changed_rating.rank_3 = params[:gum_rating_relationship][:rank_3]
    @changed_rating.rank_4 = params[:gum_rating_relationship][:rank_4]
    @changed_rating.rank_5 = params[:gum_rating_relationship][:rank_5]
=begin
    @changed_rating.gumtation = params[:gum_rating_relationship][:gumtation]
    @changed_rating.initial_gumalicious = params[:gum_rating_relationship][:initial_gumalicious]
    @changed_rating.overall_gumalicious = params[:gum_rating_relationship][:overall_gumalicious]
    @changed_rating.gumalicious_gumgevity = params[:gum_rating_relationship][:gumalicious_gumgevity]
    @changed_rating.flavoracity = params[:gum_rating_relationship][:flavoracity]
    @changed_rating.initial_chewlasticity = params[:gum_rating_relationship][:initial_chewlasticity]
    @changed_rating.overall_chewlasticity = params[:gum_rating_relationship][:overall_chewlasticity]
    @changed_rating.chewlasticity_gumgevity = params[:gum_rating_relationship][:chewlasticity_gumgevity]
    @changed_rating.bubbability = params[:gum_rating_relationship][:bubbability]
    @changed_rating.breathalation = params[:gum_rating_relationship][:breathalation]
=end
    @changed_rating.comment = params[:gum_rating_relationship][:comment]
    #values = [@changed_rating.stat_1.to_i,@changed_rating.stat_2.to_i,@changed_rating.stat_3.to_i,@changed_rating.chewlasticity.to_i,@changed_rating.gumaliciousness.to_i,@changed_rating.gumgevity.to_i,@changed_rating.bubbability.to_i]
    values = [@changed_rating.rank_1.to_i,@changed_rating.rank_2.to_i,@changed_rating.rank_3.to_i,@changed_rating.rank_4.to_i,@changed_rating.rank_5.to_i]
    @changed_rating.total = values.sum
    @changed_rating.average = (@changed_rating.total / values.size.to_i)
    if @changed_rating.save

SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%gum_specific%' AND visible = '1') ORDER BY sequence ASC
SELECT `gums`.* FROM `gums` WHERE `gums`.`active` = 1 AND `gums`.`id` = 86 LIMIT 1
---
      redirect_to(gum_url(get_permalink(@changed_rating.gum_id)))
    else
      flash[:alert] = "Can't save your rating the way it is..."
      @content_legal = DynamicText.content("gum_specific").order("sequence ASC")
      #@gum = Gum.find(params[:gum_rating_relationship][:gum_id])   #  LOL... WOW, 2+ HOURS WASTED...  DON'T FORGET:  RENDER DOESN'T EXECUTE METHOD FIRST, JUST DISPLAYS PAGE AGAIN, VARIABLES LOST...
      @gum = Gum.active.find(@changed_rating.gum_id) || not_found