app/controllers/welcomes_controller.rb

  def index
    @content_top = DynamicText.content("home_top").order("sequence ASC")
---
SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%home_top%' AND visible = '1') ORDER BY sequence ASC

  def about
    @content = DynamicText.content("about").order("sequence ASC")
---
SELECT `dynamic_texts`.* FROM `dynamic_texts` WHERE (location LIKE '%about%' AND visible = '1') ORDER BY sequence ASC